var units = {
    // mass
    'g' : [
        'gram',
        'г',
        'граммов',
        'граммам',
        'граммы',
        'гр',
        'граммами',
        'грамм',
        'грамма',
        'g'
    ],

    'mcg' : [
        'microgram',
        'микрограммов',
        'микрограмма',
        'мкг',
        'микрограммам',
        'микрограммы',
        'микрограмм',
        'микрограммами',
        'mcg'
    ],

    'mg' : [
        'milligram',
        'миллиграмма',
        'миллиграммам',
        'миллиграммами',
        'миллиграмм',
        'миллиграммов',
        'миллиграммы',
        'мг',
        'mg'
    ],

    'kg' : [
        'kilogram',
        'килограммов',
        'килограммами',
        'кг',
        'килограмма',
        'килограмм',
        'килограммы',
        'килограммам',
        'kg'
    ],

    // time
    'ms' : [
        'millisecond',
        'миллисекунды',
        'миллисекунд',
        'миллисекундам',
        'миллисекундами',
        'миллисекунда',
        'мс',
        'ms'
    ],

    's' : [
        'second',
        'секундами',
        'с',
        'секунд',
        'секунда',
        'секунды',
        'секундам',
        's'
    ],

    'min' : [
        'minute',
        'мин',
        'минуты',
        'минутами',
        'минута',
        'минутам',
        'минут',
        'min'
    ],

    'h' : [
        'hour',
        'часы',
        'часам',
        'ч',
        'часами',
        'час',
        'часов',
        'часа',
        'h'
    ],

    'd' : [
        'day',
        'дней',
        'днями',
        'дня',
        'д',
        'дням',
        'дни',
        'день',
        'd'
    ],

    'week' : [
        'week',
        'нед',
        'неделям',
        'недели',
        'неделями',
        'неделя',
        'недель',
        'week'
    ],

    // длина
    // 'picometer' : [
    //     'picometer',
    //     'пикометрами',
    //     'пикометров',
    //     'пм',
    //     'пикометр',
    //     'пикометры',
    //     'пикометра',
    //     'пикометрам'
    // ],

    // 'nanometer' : [
    //     'nanometer',
    //     'нм',
    //     'нанометров',
    //     'нанометры',
    //     'нанометрами',
    //     'нанометрам',
    //     'нанометра',
    //     'нанометр'
    // ],

    // 'micrometer' : [
    //     'micrometer',
    //     'микрометра',
    //     'микрометр',
    //     'мкм',
    //     'микрометров',
    //     'микрометрам',
    //     'микрометры',
    //     'микрометрами'
    // ],

    'mm' : [
        'millimeter',
        'миллиметра',
        'мм',
        'миллиметры',
        'миллиметрам',
        'миллиметров',
        'миллиметр',
        'миллиметрами',
        'mm'
    ],

    'cm' : [
        'centimeter',
        'сантиметрами',
        'сантиметрам',
        'сантиметра',
        'сантиметр',
        'см',
        'сантиметров',
        'сантиметры',
        'cm'
    ],

    'm' : [
        'meter',
        'метрами',
        'метры',
        'метров',
        'м',
        'метра',
        'метр',
        'метрам',
        'm'
    ],

    // сила тока
    'mA' : [
        'milliampere',
        'миллиамперам',
        'мА',
        'миллиамперы',
        'ма',
        'миллиамперов',
        'миллиамперами',
        'миллиампера',
        'миллиампер',
        'mA'
    ],

    'A' : [
        'ampere',
        'ампер',
        'амперами',
        'амперов',
        'амперы',
        'амперам',
        'А',
        'ампера',
        'A'
    ],

    // напряжение
    'mV' : [
        'millivolt',
        'мВ',
        'милливольт',
        'mV'
    ],

    'V' : [
        'volt',
        'вольты',
        'вольта',
        'В',
        'в',
        'вольт',
        'V'
    ],

    'kV' : [
        'kilovolt',
        'кВ',
        'киловольт',
        'kV'
    ],

    // 'megavolt' : [
    //     'megavolt',
    //     'мегавольт',
    //     'МВ'
    // ],

    // температура
    'C' : [
        'degree_celsius',
        '°C',
        'цельсий',
        'градусами Цельсия',
        'градус Цельсия',
        'градусы цельсия',
        'градусов цельсия',
        'C'
    ],

    'F' : [
        'degree_fahrenheit',
        'фаренгейты',
        'F',
        'градус Фаренгейта',
        '°F',
        'фаренгейт',
        'F'
    ],

    'K' : [
        'kelvin',
        'кельвины',
        'кельвинами',
        'кельвинам',
        'кельвина',
        'кельвинов',
        'К',
        'кельвин',
        'K'
    ],

    // methods
    'searchKey': function (value) {
        for (var key in units) {
            var search = units[key].indexOf(value);
            if ( search !== -1)
                return key;
        }
    }


};

module.exports = units;